app/controllers/seats_controller.rb

UPDATE "seats" SET "status" = ?, "updated_at" = ? WHERE "seats"."id" = ?  [["status", "NOT AVAILABLE"], ["updated_at", "2020-04-29 08:47:39.034030"], ["id", 1]]
---
  def update
    if @seat.update(seat_params)

SELECT  "venues".* FROM "venues" WHERE "venues"."name" = ? LIMIT ?  [["name", "venue1"], ["LIMIT", 1]]
SELECT  "seats".* FROM "seats" WHERE "seats"."seat_id" = ? LIMIT ?  [["seat_id", "a1"], ["LIMIT", 1]]
---
    def set_seat
      @venue = Venue.find_by(name: params[:id])
      @seat = @venue.seats.where(seat_id: params[:seat_id]).first