app/controllers/venues_controller.rb

  def create
    @venue = Venue.new(venue_params)

    if @venue.save
---
INSERT INTO "venues" ("name", "layout_row", "layout_column", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "venue1"], ["layout_row", 10], ["layout_column", 10], ["created_at", "2020-04-29 08:04:31.651961"], ["updated_at", "2020-04-29 08:04:31.651961"]]

    def set_venue
      @venue = Venue.find_by(name: params[:id])
---
SELECT  "venues".* FROM "venues" WHERE "venues"."name" = ? LIMIT ?  [["name", "venue4"], ["LIMIT", 1]]

    def get_seats params
      resp = {}
      logger.debug "somappa #{params}"
      if params.has_key? "requested_seats"
        if params.requested_seats > 1

        else
          # Get middle first by descending closest
          seats = @venue.seats.where(status: "AVAILABLE").order(closest: "asc").order(created_at: "asc").limit(3)
          seats.each do |seat|
            resp[seat.seat_id] = {id: seat.seat_id, row: seat.row, column: seat.column, status: seat.status}
          end
        end
      else
        # Get middle first by descending closest
        seats = @venue.seats.where(status: "AVAILABLE").order(closest: "asc").order(created_at: "asc").limit(3)
        seats.each do |seat|
---
SELECT  "seats".* FROM "seats" WHERE "seats"."venue_id" = ? AND "seats"."status" = ? ORDER BY "seats"."closest" DESC, "seats"."created_at" ASC LIMIT ?  [["venue_id", 2], ["status", "AVAILABLE"], ["LIMIT", 3]]